function K = elemK3D(EX,mu,x,y,z,reduce,mnode)
% 计算单元刚度矩阵
% 三维六面体单元
% 权积分高斯点位置为+0.577350269189626,-0.577350269189626，权系数为1
% 减缩积分高斯点位置为0，权系数为2
K = zeros(mnode*3,mnode*3);
D = EX*(1-mu)/((1+mu)*(1-2*mu))*[1,mu/(1-mu),mu/(1-mu),0,0,0;mu/(1-mu),1,mu/(1-mu),0,0,0;...
    mu/(1-mu),mu/(1-mu),1,0,0,0;0,0,0,(1-2*mu)/(2*(1-mu)),0,0;0,0,0,0,(1-2*mu)/(2*(1-mu)),0;...
    0,0,0,0,0,(1-2*mu)/(2*(1-mu))];

if reduce == 0 % 采用完全积分
    nip = 3; % 单维方向的积分点数
    ks = [-0.774596669241483,0,0.774596669241483]; % 积分点
    w = [0.55555555555556,0.888888888888888889,0.55555555555556]; % 权系数
else
    nip = 2; % 单维方向的积分点数
    ks = [-0.577350269189626,0.577350269189626]; % 积分点
    w = [1,1]; % 权系数
end

for m = 1:nip
    for n = 1:nip
        for j = 1:nip
            [J,B] = elemB3D(x,y,z,ks(m),ks(n),ks(j),mnode);
            K = K + w(m)*w(n)*w(j)*B'*D*B*det(J);
        end
    end
end